sensorOpt/con/10_deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       231206;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       231606;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       231806;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       232206;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          115704;
        startFace       232406;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          115704;
        startFace       348110;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          474;
        startFace       463814;
    }
)

// ************************************************************************* //
